Revit 2027 API
TableSectionData.HideSection Property
 Whether or not the section is hidden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HideSection { get; set; }
Public Property HideSection As Boolean
	Get
	Set
public:
property bool HideSection {
	bool get ();
	void set (bool value);
}
member HideSection : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace